Junior Year/January 2019/Assignment 3/Tutorial Files/TUT1/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1890
(
0.000109616
-3.43524e-008
0.000109701
-8.41772e-008
0.000109769
-6.86156e-008
0.000109824
-5.47975e-008
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(-0.000109582 -0.000109599 -0.000109634 -0.00010969 -0.000109768 -0.000109876 -0.000110024 -0.000110231 -0.000110538 -0.000111033);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011);
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
